apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_sock.c
  volatile uint32_t *const rxfnc = (uint32_t *)(priv->base + offset_rxfnc);
  volatile uint32_t *const rxfns = (uint32_t *)(priv->base + offset_rxfns);
  volatile uint32_t *const rxfna = (uint32_t *)(priv->base + offset_rxfna);

  /* Check number of elements in message RAM allocated to this FIFO */

  if ((*rxfnc & FDCAN_RXF0C_F0S) == 0)
    {
      nerr("ERROR: No RX FIFO elements allocated");
      leave_critical_section(flags);
      return;
    }

  /* Check for message lost; count an error */

  if ((*rxfns & FDCAN_RXF0S_RF0L) != 0)
    {
      NETDEV_RXERRORS(&priv->dev);
    }

  /* Check number of elements available (fill level) */

  const uint8_t n_elem = (*rxfns & FDCAN_RXF0S_F0FL);

  if (n_elem == 0)
    {
      nerr("RX interrupt but 0 frames available");
      leave_critical_section(flags);
      return;
    }

  struct rx_fifo_s *rf = NULL;

  while ((*rxfns & FDCAN_RXF0S_F0FL) > 0)
    {
      /* Copy the frame from message RAM */

      const uint8_t index = (*rxfns & FDCAN_RXF0S_F0GI) >>
                             FDCAN_RXF0S_F0GI_SHIFT;

      rf = &priv->rx[index];

      /* Read the frame contents */

#ifdef CONFIG_NET_CAN_CANFD
      if (rf->header.fdf)
        {
          /* CAN FD frame */

          struct canfd_frame *frame = (struct canfd_frame *)priv->rx_pool;

          if (rf->header.id.xtd)
            {
              frame->can_id  = CAN_EFF_MASK & rf->header.id.extid;
              frame->can_id |= CAN_EFF_FLAG;
            }
          else
            {
              frame->can_id = CAN_SFF_MASK & rf->header.id.stdid;
            }

          if (rf->header.id.rtr)
            {
              frame->can_id |= CAN_RTR_FLAG;
            }

          frame->len = g_can_dlc_to_len[rf->header.dlc];

          uint32_t *frame_data_word = (uint32_t *)&frame->data[0];

          for (int i = 0; i < (frame->len + 4 - 1) / 4; i++)
            {
              frame_data_word[i] = rf->data[i].word;
            }

          /* Acknowledge receipt of this FIFO element */

          putreg32(index, rxfna);

          /* Copy the buffer pointer to priv->dev
           * Set amount of data in priv->dev.d_len
           */

          priv->dev.d_len = sizeof(struct canfd_frame);
          priv->dev.d_buf = (uint8_t *)frame;
        }
      else
#endif
        {
          /* CAN 2.0 Frame */

          struct can_frame *frame = (struct can_frame *)priv->rx_pool;

          if (rf->header.id.xtd)
            {
              frame->can_id  = CAN_EFF_MASK & rf->header.id.extid;
              frame->can_id |= CAN_EFF_FLAG;
            }
          else
            {
              frame->can_id = CAN_SFF_MASK & rf->header.id.stdid;
            }

          if (rf->header.id.rtr)
            {
              frame->can_id |= CAN_RTR_FLAG;
            }

          frame->can_dlc = rf->header.dlc;

          *(uint32_t *)&frame->data[0] = rf->data[0].word;
          *(uint32_t *)&frame->data[4] = rf->data[1].word;

          /* Acknowledge receipt of this FIFO element */

          putreg32(index, rxfna);

          /* Copy the buffer pointer to priv->dev
           * Set amount of data in priv->dev.d_len
           */

          priv->dev.d_len = sizeof(struct can_frame);
          priv->dev.d_buf = (uint8_t *)frame;
        }

      /* Send to socket interface */

      can_input(&priv->dev);

      /* Update iface statistics */

      NETDEV_RXPACKETS(&priv->dev);

      /* Point the packet buffer back to the next Tx buffer that will be
       * used during the next write.  If the write queue is full, then
       * this will point at an active buffer, which must not be written
       * to.  This is OK because devif_poll won't be called unless the
       * queue is not full.
       */

      priv->dev.d_buf = priv->tx_pool;
    }

  /* Check for errors and abort-transmission requests */

  fdcan_check_errors(priv);

#ifdef CONFIG_NET_CAN_ERRORS
  uint32_t regval;

  /* Turning back on all configured RX error interrupts */

  regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
  regval |= FDCAN_RXERR_INTS;
  putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
#endif

  leave_critical_section(flags);
}

/****************************************************************************
 * Function: fdcan_txdone
 *
 * Description:
 *   An interrupt was received indicating that the last TX packet(s) is done
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called from interrupt context
 *
 ****************************************************************************/

static void fdcan_txdone(struct fdcan_driver_s *priv)
{
  /* Read and reset the interrupt flag */

  uint32_t ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);

  if (ir & FDCAN_IR_TC)
    {
      putreg32(FDCAN_IR_TC, priv->base + STM32_FDCAN_IR_OFFSET);
    }
  else
    {
      nerr("Unexpected FCAN interrupt on line 1\n");
      return;
    }

  /* Schedule to perform the TX timeout processing on the worker thread */

  work_queue(CANWORK, &priv->txdwork, fdcan_txdone_work, priv, 0);
}

/****************************************************************************
 * Function: fdcan_txdone_work
 *
 * Description:
 *   Process completed transmissions, including canceling their watchdog
 *   timers if applicable
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Scheduled in worker thread (HPWORK / LPWORK)
 *
 ****************************************************************************/

static void fdcan_txdone_work(void *arg)
{
  irqstate_t flags = enter_critical_section();

  struct fdcan_driver_s *priv = (struct fdcan_driver_s *)arg;

  /* Update counters for successful transmissions */

  for (uint8_t i = 0; i < NUM_TX_FIFO; i++)
    {
      if ((getreg32(priv->base + STM32_FDCAN_TXBTO_OFFSET) & (1 << i)) > 0)
        {
          /* Transmission Occurred in buffer i
           *   (Not necessarily a 'new' transmission, however)
           * Check that it's a new transmission, not a previously handled
           * transmission
           */

          struct txmbstats *txi = &priv->txmb[i];

          if (txi->pending == TX_BUSY)
            {
              /* This is a transmission that just now completed */

              NETDEV_TXDONE(&priv->dev);

              txi->pending = TX_FREE;

#ifdef TX_TIMEOUT_WQ
              /* We are here because a transmission completed, so the
               * corresponding watchdog can be canceled.
               */

              wd_cancel(&priv->txmb[i].txtimeout);
#endif
            }
        }
    }

  /* Check for errors and abort-transmission requests */

  fdcan_check_errors(priv);

